Revit 2027 API
FabricationPart.ProductName Property
 The product name of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ProductName { get; }
Public ReadOnly Property ProductName As String
	Get
public:
property String^ ProductName {
	String^ get ();
}
member ProductName : string with get
Property Value
String
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace